In [1]:
print("Hello")

Hello

Title Here

In [2]:
#This is a comment

In [4]:
import pandas as pd

In [7]:
print("Hello world")

Hello world

<h1>To Do 5/12</h2>
<p style="font-size:20px;">
Exercise 1-20:
Load a CSV file into a pandas DataFrame.

Check the first 5 rows of the DataFrame.

Get the shape of the DataFrame (rows, columns).

Get summary statistics (mean, median, mode, std) of numerical columns.

Get the data types of each column.

Check for missing values in each column.

Rename a column in the DataFrame.

Filter the DataFrame to get rows where a column value is greater than a certain number.

Select specific columns from the DataFrame.

Drop a column from the DataFrame.

Apply a transformation to a column (e.g., multiply each value by 2).

Add a new column based on an operation on existing columns.

Group the data by a categorical column and get the mean of each group.

Sort the DataFrame based on a specific column.

Merge two DataFrames on a common column.

Join two DataFrames using an index.

Apply a function to each element in a column using .apply().

Create a new DataFrame by filtering rows based on multiple conditions.

Convert a column from string to a numeric type.

Save the modified DataFrame to a new CSV file.
</p>

In [91]:
locations = pd.read_csv('../../BATCH/Files/locations.csv')
departments = pd.read_csv('../../BATCH/Files/departments.csv')
employees = pd.read_csv('../../BATCH/Files/employees.csv')
projects = pd.read_csv('../../BATCH/Files/projects.csv')
salaries = pd.read_csv("../../BATCH/Files/salaries.csv")

In [92]:
#Check the first 5 rows of the DataFrame
salaries.head(5)

   EmployeeID  Salary  Bonus
0           1   55000   5000
1           2   46000   3000
2           3   60000   7000
3           4   75000   8000
4           5   49000   2000

In [74]:
#Get the shape of the DataFrame (rows, columns)
salaries.shape

(10, 5)

In [49]:
projects.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProjectID    10 non-null     int64
 1   EmployeeID   10 non-null     int64
 2   ProjectName  10 non-null     object
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes

In [17]:
#Get summary statistics (mean, median, mode, std) of numerical columns.
salaries.describe()

       EmployeeID        Salary         Bonus
count    10.00000     10.000000     10.000000
mean      5.50000  61900.000000   5850.000000
std       3.02765  16044.729145   3448.429594
min       1.00000  43000.000000   1500.000000
25%       3.25000  49750.000000   3250.000000
50%       5.50000  57500.000000   5500.000000
75%       7.75000  73000.000000   7750.000000
max      10.00000  90000.000000  12000.000000

In [22]:
mode_values = salaries.mode().iloc[1]
mode_values

EmployeeID        2
Salary        46000
Bonus          2000
Name: 1, dtype: int64

In [50]:
#Get the data types of each column
projects.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProjectID    10 non-null     int64
 1   EmployeeID   10 non-null     int64
 2   ProjectName  10 non-null     object
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes

In [98]:
#Check for missing values in each column
missing_counts = employees.isna().sum()
missing_counts

EmployeeID    0
Name          0
Department    0
Salary        0
dtype: int64

In [93]:
#Rename a column in the DataFrame
projects = projects.rename(columns={'ProjectName': 'ProjectDone'})
projects.head()

   ProjectID  EmployeeID      ProjectDone
0        101           1    Project Alpha
1        102           2     Project Beta
2        103           3    Project Gamma
3        104           4    Project Delta
4        105           5  Project Epsilon

In [62]:
#Filter the DataFrame to get rows where a column value is greater than a certain number
filtered_df = employees[employees["Pay"] > 60000]
filtered_df

   EmployeeID       Name   Department    Pay
3           4      Linda           HR  75000
6           7    Michael           HR  82000
7           8  Elizabeth  Engineering  67000
9          10      Susan           HR  90000

In [65]:
#Select specific columns from the DataFrame
df1 = employees[["Name", "EmployeeID"]]
df1.head()

    Name  EmployeeID
0   John           1
1   Anna           2
2  Peter           3
3  Linda           4
4  James           5

In [94]:
#Drop a column from the DataFrame
print(projects.drop('ProjectDone', axis=1))

   ProjectID  EmployeeID
0        101           1
1        102           2
2        103           3
3        104           4
4        105           5
5        106           6
6        107           7
7        108           8
8        109           9
9        110          10

In [95]:
#Apply a transformation to a column (e.g., multiply each value by 2)
salaries["Bonus"]= salaries['Bonus'] * 2
salaries.head()

   EmployeeID  Salary  Bonus
0           1   55000  10000
1           2   46000   6000
2           3   60000  14000
3           4   75000  16000
4           5   49000   4000

In [96]:
#Add a new column based on an operation on existing columns
salaries["Multiplied"]= salaries['Salary'] * 2
salaries.head()

   EmployeeID  Salary  Bonus  Multiplied
0           1   55000  10000      110000
1           2   46000   6000       92000
2           3   60000  14000      120000
3           4   75000  16000      150000
4           5   49000   4000       98000

In [89]:
#Group the data by a categorical column and get the mean of each group
print(employees.groupby('Department')["Pay"].mean())

Department
Engineering    58500.000000
HR             82333.333333
Marketing      46000.000000
Name: Pay, dtype: float64

In [67]:
#Sort the DataFrame based on a specific column
trip = salaries["Bonus"].sort_values()
trip

8     1500
4     2000
1     3000
5     4000
0     5000
7     6000
2     7000
3     8000
6    10000
9    12000
Name: Bonus, dtype: int64

In [97]:
#Merge two DataFrames on a common column
df3 = pd.merge(salaries, projects, on='EmployeeID')
df3.head()

   EmployeeID  Salary  Bonus  Multiplied  ProjectID      ProjectDone
0           1   55000  10000      110000        101    Project Alpha
1           2   46000   6000       92000        102     Project Beta
2           3   60000  14000      120000        103    Project Gamma
3           4   75000  16000      150000        104    Project Delta
4           5   49000   4000       98000        105  Project Epsilon

In [69]:
salaries["Total"] = salaries['Salary'] + salaries['Bonus']
salaries.head()

   EmployeeID  Salary  Bonus  Multiplied  Total
0           1   55000   5000      110000  60000
1           2   46000   3000       92000  49000
2           3   60000   7000      120000  67000
3           4   75000   8000      150000  83000
4           5   49000   2000       98000  51000

In [ ]:
#Join two DataFrames using an index
print(pd.merge(salaries, employees, left_index=True, right_index=True))

            Salary_x  Bonus  Multiplied       Name   Department  Salary_y
EmployeeID
1              55000  10000      110000       John  Engineering     55000
2              46000   6000       92000       Anna    Marketing     46000
3              60000  14000      120000      Peter  Engineering     60000
4              75000  16000      150000      Linda           HR     75000
5              49000   4000       98000      James    Marketing     49000
6              52000   8000      104000   Patricia  Engineering     52000
7              82000  20000      164000    Michael           HR     82000
8              67000  12000      134000  Elizabeth  Engineering     67000
9              43000   3000       86000      David    Marketing     43000
10             90000  24000      180000      Susan           HR     90000

In [ ]:
#Apply a function to each element in a column using .apply()
locations["City"] = locations["Location"].apply(lambda x: x.replace("New York", "NY").replace("San Francisco", "SF").replace("Los Angeles", "LA"))
locations.head()

In [99]:
#Create a new DataFrame by filtering rows based on multiple conditions
filtered_df = employees[(employees['Salary'] > 54000) & (employees['Department'] == 'Engineering')]
filtered_df

   EmployeeID       Name   Department  Salary
0           1       John  Engineering   55000
2           3      Peter  Engineering   60000
7           8  Elizabeth  Engineering   67000

In [102]:
#Convert a column from string to a numeric type
#df['column_name'] = pd.to_numeric(df['column_name'])
#df['column_name'] = df['column_name'].astype(int)

In [100]:
#Save the modified DataFrame to a new CSV file
filtered_df.to_csv('../../BATCH/Files/filteredFile.csv', index=False)

In [1]:
#com